---
type: MEPCurve
namespace: Autodesk.Revit.DB
version: 2024
members: 8
tags: [revit-api, class]
---

# MEPCurve

`Autodesk.Revit.DB.MEPCurve` · Revit 2024 · 8 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ConnectorManager | — | `public ConnectorManager ConnectorManager { get ; }` |
| Property | Diameter | — | `public double Diameter { get ; }` |
| Property | Height | — | `public double Height { get ; }` |
| Property | LevelOffset | — | `public double LevelOffset { get ; set ; }` |
| Property | MEPSystem | — | `public MEPSystem MEPSystem { get ; }` |
| Property | Parameter | — | `` |
| Property | ReferenceLevel | — | `public Level ReferenceLevel { get ; set ; }` |
| Property | Width | — | `public double Width { get ; }` |